[
  {
    "id": 1,
    "name": ".NET设计规范",
    "author": "KrzysztofCwalina",
    "introduction": "本书关注直接影响框架可编程能力的设计问题，为框架设计师和广大开发人员设计高质量的软件提供了权威的指南，这一版更新至NET 3.5。书中内容涉及框架设计的基本原则和规范，常用设计惯用法，为命名空间、类型、成员等框架各部分命名的规范，框架中常用设计模式的规范等。同时，书中添加了来自经验丰富的框架设计师、业界专家及用户给出的评注，为书中的许多规范增色不少。本书关注直接影响框架可编程能力的设计问题，为框架设计师和广大开发人员设计高质量的软件提供了权威的指南，这一版更新至NET 3.5。书中内容涉及框架设计的基本原则和规范，常用设计惯用法，为命名空间、类型、成员等框架各部分命名的规范，框架中常用设计模式的规范等。\n同时，书中添加了来自经验丰富的框架设计师、业界专家及用户给出的评注，为书中的许多规范增色不少。本书关注直接影响框架可编程能力的设计问题，为框架设计师和广大开发人员设计高质量的软件提供了权威的指南，这一版更新至NET 3.5。书中内容涉及框架设计的基本原则和规范，常用设计惯用法，为命名空间、类型、成员等框架各部分命名的规范，框架中常用设计模式的规范等。同时，书中添加了来自经验丰富的框架设计师、业界专家及用户给出的评注，为书中的许多规范增色不少。本书关注直接影响框架可编程能力的设计问题，为框架设计师和广大开发人员设计高质量的软件提供了权威的指南，这一版更新至NET 3.5。书中内容涉及框架设计的基本原则和规范，常用设计惯用法，为命名空间、类型、成员等框架各部分命名的规范，框架中常用设计模式的规范等。同时，书中添加了来自经验丰富的框架设计师、业界专家及用户给出的评注，为书中的许多规范增色不少。本书关注直接影响框架可编程能力的设计问题，为框架设计师和广大开发人员设计高质量的软件提供了权威的指南，这一版更新至NET 3.5。书中内容涉及框架设计的基本原则和规范，常用设计惯用法，为命名空间、类型、成员等框架各部分命名的规范，框架中常用设计模式的规范等。同时，书中添加了来自经验丰富的框架设计师、业界专家及用户给出的评注，为书中的许多规范增色不少。本书关注直接影响框架可编程能力的设计问题，为框架设计师和广大开发人员设计高质量的软件提供了权威的指南，这一版更新至NET 3.5。书中内容涉及框架设计的基本原则和规范，常用设计惯用法，为命名空间、类型、成员等框架各部分命名的规范，框架中常用设计模式的规范等。同时，书中添加了来自经验丰富的框架设计师、业界专家及用户给出的评注，为书中的许多规范增色不少。本书关注直接影响框架可编程能力的设计问题，为框架设计师和广大开发人员设计高质量的软件提供了权威的指南，这一版更新至NET 3.5。书中内容涉及框架设计的基本原则和规范，常用设计惯用法，为命名空间、类型、成员等框架各部分命名的规范，框架中常用设计模式的规范等。同时，书中添加了来自经验丰富的框架设计师、业界专家及用户给出的评注，为书中的许多规范增色不少。本书关注直接影响框架可编程能力的设计问题，为框架设计师和广大开发人员设计高质量的软件提供了权威的指南，这一版更新至NET 3.5。书中内容涉及框架设计的基本原则和规范，常用设计惯用法，为命名空间、类型、成员等框架各部分命名的规范，框架中常用设计模式的规范等。同时，书中添加了来自经验丰富的框架设计师、业界专家及用户给出的评注，为书中的许多规范增色不少。"
  },
  {
    "id": 2,
    "name": "java2 入门经典",
    "author": "Horton",
    "introduction": "本书综合介绍了使用J2SE(Java 2 Standard Edition)5．0或更高版本开发动态程序的过程，阐述了Java语言的各个方面，包括Java语言结构和工作原理的基本知识，用大量的实例讲述如何开发功能齐全的Java应用程序，以期帮助读者掌握Java语言的最新特性和Java类库中主要的功能包，积累Java应用环境的使用经验，并在核心技术领域打下坚实的基础。\n本书综合介绍了使用J2SE(Java 2 Standard Edition)5．0或更高版本开发动态程序的过程，阐述了Java语言的各个方面，包括Java语言结构和工作原理的基本知识，用大量的实例讲述如何开发功能齐全的Java应用程序，以期帮助读者掌握Java语言的最新特性和Java类库中主要的功能包，积累Java应用环境的使用经验，并在核心技术领域打下坚实的基础。"
  },
  {
    "id": 3,
    "name": "中国国家地理",
    "author": "《中国国家地理》杂志社",
    "introduction": "本刊内容以中国地理为主，兼具世界各地不同区域的自然、人文景观和事件，并揭示其背景和奥秘，另亦涉及天文、生物、历史和考古等领域。是中国大陆著名的有关地理的杂志。本刊内容以中国地理为主，兼具世界各地不同区域的自然、人文景观和事件，并揭示其背景和奥秘，另亦涉及天文、生物、历史和考古等领域。是中国大陆著名的有关地理的杂志。本刊内容以中国地理为主，兼具世界各地不同区域的自然、人文景观和事件，并揭示其背景和奥秘，另亦涉及天文、生物、历史和考古等领域。是中国大陆著名的有关地理的杂志。本刊内容以中国地理为主，兼具世界各地不同区域的自然、人文景观和事件，并揭示其背景和奥秘，另亦涉及天文、生物、历史和考古等领域。是中国大陆著名的有关地理的杂志。\n本刊内容以中国地理为主，兼具世界各地不同区域的自然、人文景观和事件，并揭示其背景和奥秘，另亦涉及天文、生物、历史和考古等领域。是中国大陆著名的有关地理的杂志。"
  },
  {
    "id": 4,
    "name": "中国自助游",
    "author": "《中国自助游》编辑部",
    "introduction": "很多人不愿出门旅游，是因为他们有过不愉快的旅游经历，或者惧怕对外地的\n无知，其实，旅游也是需要知识准备的，如果我们对旅途的精彩和问题都胸有成竹，剩下的，就将是段远离日常烦恼的上路经验。不愿受旅行团约束，但又对陌生的地方无所适从；热爱自由，但不想为自由付过多的钱；只能利用节假日的时间外出，但又不想所到之处都人满为患；厌倦了肤浅的走马观花，希望来一次有深度的游览；总之，这是一本为真正渴望发现旅游乐趣的人准备的指南。\n《中国自助游》2006升级版延续以往风格，由资深旅游者和当地旅游局提供千锤百炼的第一手资料，并以更深入、更细致的态度，更务实、更专业的精神连续第5年全面更新，升级后的2006版共计72万字、120幅实用地图、816幅精美图片、3万余条即时资讯，深入介绍149个旅游城市、景区及1529个景点……\n2002年1月，我们推出以“读行天下”为品牌的第本旅游图书《自助游中国完全手册》，在随后的改版中更名为《中国自助游》在我们编辑部两年日以继夜地努力下，本书一经面世，就成为读者最乐于选择的旅行指南。\n5年来，我们年年推出升级版每次更新，都清楚地感到肩头的重担，丝毫不敢懈怠，力求升级得更加全面、彻底、时效从而确保本书的金牌品质，让书中的每篇文字、每张图片伴随我们一起获得一种重生的幸福。"
  },
  {
    "id": 5,
    "name": "别做正常的傻瓜",
    "author": "奚恺元",
    "introduction": "本书结合了作者十余年的教学经验，融合了诺贝尔奖得主及其他学者数十年的研究成果，用深入浅出的方法帮助你发现自己决策中的误区，从而使你比大多数人少几分正常，多几分理性，除非你从不做决策，否则本书对你一定有所借鉴。"
  },
  {
    "id": 6,
    "name": "培育男孩",
    "author": "詹姆士·杜布森",
    "introduction": "欢迎大家一起来学习《培育男孩》的课程。本书的目的很明确，就是帮助大家从《培育男孩》系列录像中收获更多。《培育男孩》系列录像由畅销书作家及心理学家詹姆士·杜布森博士主讲。如果你在一个小组中观看这个录像片，我们希望你的经历尽可能生动、与生活息息相关，而且是改变生命的。\n本书的每个单元包括如下内容：\n引文及问题。在参加小组之前，请先阅读杜布森博士的《培育男孩》一书中的一段引文。然后回答后面的问题。这可以为你看录像片做准备。\n录像笔记。在与小组一起观看录像时。边看边做笔记可以帮助你找到关键的概念。这一部分提供了大纲性的提示，可以帮助你轻松地做笔记。\n应用。在练习中。你和你的小组将开始把“培育男孩”的原则与你自己的实际经验相结合。\n试一试。这一部分提供一些操作性强、颇具创意的方法，帮助你将所学的原则应用到自己的男孩子们身上。你可以在课后使用这些方法。\n无论你现在是否正在培育男孩，无论你是单身还是已婚人士，这个系列课程都将帮助你获得大量的有用信息。对于那些令人陶醉又使人烦恼的、由“蛇、蜗牛和小狗尾巴”做成的宝贵男孩子们有更深入的了解。请欣赏这些录像吧——并且也欣赏你身边的男孩子们！"
  },
  {
    "id": 7,
    "name": "大勇和小花的欧洲日记",
    "author": "林若岚",
    "introduction": "带着对茜茜公主故乡的美好想象，踏上16日德、奥自助行程，不必匆匆忙忙地赶路，借助从不晚点的德国交通系统和准备充分的线路攻略，度过又一个悠闲的欧洲假日：在莱茵河岸的古体堡中徜徉，迷失于中世纪的罗滕堡小镇，看白天鹅跳舞，感叹一代童话国王的悲伤；漫步海德堡的雨中，做一天慕尼黑人，在维也纳金色大厅见识光鲜殿堂的另一面，从湖畔小镇到世外桃源，尽情享受纯粹的奥地利乡间生活，更意外遭遇人生中第一次滑雪经历……“钱花完了，留下的只有感受和记忆，可这是属于我们自己的财富，一切都是值得的。”700多张照片见证了这个浪漫的行程，幸福，就在相机前的那两张笑脸上。"
  },
  {
    "id": 8,
    "name": "学会宽容",
    "author": "苏隶东",
    "introduction": "在本书中，我们把生命的本质、生活的秘密呈现给大家，顺境逆境是人生的常态，在逆境时，更要泰然处之。当你学会了宽容。你便能领悟生命的真谛，洞察人性的弱点，走出生命的盲区，成为生活的智者。"
  },
  {
    "id": 9,
    "name": "搭地铁玩上海",
    "author": "曹忆雯、黄志伟",
    "introduction": "闪烁着旧上海余韵的百乐门大舞厅，撩拨着老上海尘封记忆的老洋房餐馆，缅怀着老上海浮华奢丽的上海新天地…… 这本书不强调让您看到上海全貌，而是作者亲身感受过的上海精华，无论最经典、最时尚、最话题，或者最有趣、最美味、最动人……有了本书，你可以随意自如地荡上海，也许在不经意行走间，你已经历了一些美好的事情……"
  },
  {
    "id": 10,
    "name": "时空穿行",
    "author": "庄孔韶",
    "introduction": "《时空穿行(中国乡村人类学世纪回访)》对20世纪80年代以来中国云南大理西镇、广东潮州凤凰村、华南茶山等八个代表性乡村田野进行调查，探讨了中国乡村文化的多样性、宗族制度、农民社会等课题。"
  },
  {
    "id": 11,
    "name": "杜拉拉升职记",
    "author": "李可",
    "introduction": "中国白领必读的职场修炼小说。\n大部分人是要谋生的，不单要谋生，而且希望谋得好。\n小说《杜拉拉升职记》\n小说《杜拉拉升职记》(2张)\n说到谋生，有人适合自己做老板，更多的人则靠打工。其实，自己做老板，也就是给自己打工。您可以消遣的来看看这本纯属虚构的小说，也可以把它当经验分享之类的职场实用手册来使用。\n可能你干了很多活上司却不待见你，没准你有个本事不大脾气不小的下属，也许你的平级争风吃醋不怀好意，或者你的客户拽得像二五八万——你要很好地完成任务，就要设法摆平他们。\n你可以消遣地来看看这本纯属虚构的小说，也可以把它当经验分享之类的职场实用手册来使用。小说的主人公杜朝阳是典型的中产阶级代表，她没有背景，受过较好的教育，靠个人奋斗获取成功。小说中拉拉在外企的经历跨度八年，拉拉从一个朴实的销售助理，成长为一个专业干练的HR经理，见识了各种职场变迁，也历经了各种职场磨练。\n对于大部分人来说，她的故事比比尔·盖茨的更值得参考"
  },
  {
    "id": 12,
    "name": "沉思录",
    "author": "马可·奥勒留",
    "introduction": "《沉思录》来自于作者对身羁宫廷的自身和自己所处混乱世界的感受，追求一种摆脱了激情和欲望、冷静而达观的生活。马可·奥勒留在书中阐述了灵魂与死亡的关系，解析了个人的德行、个人的解脱以及个人对社会的责任，要求常常自省以达到内心的平静，要摒弃一切无用和琐屑的思想、正直地思考。而且，不仅要思考善、思考光明磊落的事情，还要付诸行动。"
  },
  {
    "id": 13,
    "name": "深入浅出Oracle",
    "author": "盖国强",
    "introduction": "针对数据库的启动和关闭、参数及参数文件、数据字典、内存管理、Buffer Cache与Shared Pool原理、重做、回滚与撤销、等待事件、性能诊断与SQL优化等几大Oracle热点主题，本书从基础知识入手，深入研究相关技术，并结合性能调整及丰富的诊断案例，力图将Oracle知识全面、系统、深入地展现给读者。"
  },
  {
    "id": 14,
    "name": "美国纽约摄影学院摄影教材",
    "author": "唐·谢夫",
    "introduction": "本教材的每一课和本学院的每一位同仁都只有一个目的，就是帮助你们走上成功之路，教给你们作为一个成功的职业摄影家或一流的业余摄影师所必备的一切技艺。"
  },
  {
    "id": 15,
    "name": "谁动了我的奶酪？",
    "author": "斯宾塞·约翰逊",
    "introduction": "两只小老鼠“嗅嗅”、“匆匆”和两个小矮人“哼哼”、“唧唧”，他们生活在一个迷宫里，奶酪是他们要追寻的东西。有一天，他们同时发现了一个储量丰富的奶酪仓库，便在其周围构筑起自己的幸福生活。很久之后的某天，奶酪突然不见了。这个突如其来的变化使他们的心态暴露无疑：嗅嗅，匆匆随变化而动，立刻穿上始终挂在脖子上的鞋子，开始出去再寻找，并很快就找到了更新鲜更丰富的奶酪：而两个小矮人哼哼和唧唧，面对变化却犹豫不决，烦恼丛生，始终无法接受奶酪已经消失的残酷现实。经过激烈的思想斗争，唧唧终于冲破了思想的束缚，穿上久置不用的跑鞋，重新进入漆黑的迷宫，并最终找到了更多更好的奶酪，而哼哼却仍在郁郁寡欢、怨天尤人。"
  },
  {
    "id": 16,
    "name": "赢在影响力：人际交往的学问",
    "author": "戴尔·卡耐基",
    "introduction": "戴尔·卡耐基：美国著名心理学家，人际关系学家，20世纪最伟大的人生导师，他以超人的智慧，严谨的思维，在道德，精神和行为准则上指导了万千读者。他一生中亲笔写作了《人性的弱点》、《人性的光辉》、《语言突破》、《林肯传》、《人性的弱点》等。"
  },
  {
    "id": 17,
    "name": "震撼心灵的116个生命感悟",
    "author": "李馨馨",
    "introduction": "有一种感觉，叫震撼。有一种心情，叫感动。有一种声音，叫呐喊。有一句评价，叫好书。《震撼心灵的116个生命感悟》就是能让你震撼，让你感动，让你想要呐喊的好书！繁忙的生活节奏让我们越来越麻木，越来越难以感动。我们假装生活在别处，我们闭上眼睛以为不会看见，我们堵上耳朵以为不会听见。但是我们的心是不会死去的。在这些震撼心灵的生命感悟面前，我们能清楚地听见自己撕裂的心灵与灵魂的对话，曾经麻木的心在疼痛中慢慢复苏。"
  },
  {
    "id": 18,
    "name": "鱼的意大利旅行",
    "author": "赵于萱",
    "introduction": "《鱼的意大利旅行》是一本介绍到意大利的风土人情与旅行经历的书籍。"
  }
]